-- 1. 대분류 (parent_id = NULL)
INSERT INTO categories (name, description, parent_id) VALUES
    ('상의', '상의 카테고리', NULL),
    ('바지', '바지 카테고리', NULL),
    ('원피스/스커트', '원피스/스커트 카테고리', NULL),
    ('패션소품', '패션소품 카테고리', NULL),
    ('가방', '가방 카테고리', NULL),
    ('신발', '신발 카테고리', NULL);

-- 2. 상의 하위 카테고리 (parent_id = 1)
INSERT INTO categories (name, description, parent_id) VALUES
    ('니트/스웨터', '니트/스웨터', 1),
    ('맨투맨/스웨터', '맨투맨/스웨터', 1),
    ('긴소매 티셔츠', '긴소매 티셔츠', 1),
    ('후드 티셔츠', '후드 티셔츠', 1),
    ('셔츠/블라우스', '셔츠/블라우스', 1),
    ('반소매 티셔츠', '반소매 티셔츠', 1),
    ('피케/카라 티셔츠', '피케/카라 티셔츠', 1),
    ('기타 상의', '기타 상의', 1),
    ('민소매 티셔츠', '민소매 티셔츠', 1);

-- 3. 바지 하위 카테고리 (parent_id = 2)
INSERT INTO categories (name, description, parent_id) VALUES
    ('트레이닝/조거 팬츠', '트레이닝/조거 팬츠', 2),
    ('코튼 팬츠', '코튼 팬츠', 2),
    ('데님 팬츠', '데님 팬츠', 2),
    ('슈트 팬츠/슬랙스', '슈트 팬츠/슬랙스', 2),
    ('기타 하의', '기타 하의', 2),
    ('점프 슈트/오버올', '점프 슈트/오버올', 2),
    ('숏 팬츠', '숏 팬츠', 2),
    ('레깅스', '레깅스', 2);

-- 4. 원피스/스커트 하위 카테고리 (parent_id = 3)
INSERT INTO categories (name, description, parent_id) VALUES
    ('미디스커트', '미디스커트', 3),
    ('롱스커트', '롱스커트', 3),
    ('맥시원피스', '맥시원피스', 3),
    ('미디원피스', '미디원피스', 3),
    ('미니스커트', '미니스커트', 3),
    ('미니원피스', '미니원피스', 3);

-- 5. 패션소품 하위 카테고리 (parent_id = 4)
INSERT INTO categories (name, description, parent_id) VALUES
    ('액세서리', '액세서리', 4),
    ('주얼리', '주얼리', 4),
    ('머플러', '머플러', 4),
    ('모자', '모자', 4),
    ('양말/레그웨어', '양말/레그웨어', 4),
    ('벨트', '벨트', 4),
    ('선글라스/안경테', '선글라스/안경테', 4),
    ('시계', '시계', 4);

-- 6. 가방 하위 카테고리 (parent_id = 5)
INSERT INTO categories (name, description, parent_id) VALUES
    ('숄더백', '숄더백', 5),
    ('메신저/크로스 백', '메신저/크로스 백', 5),
    ('토트백', '토트백', 5),
    ('에코백', '에코백', 5),
    ('보스턴/더플백', '보스턴/더플백', 5),
    ('파우치백', '파우치백', 5),
    ('웨이스 백', '웨이스 백', 5),
    ('가방 소품', '가방 소품', 5),
    ('브리프 케이스', '브리프 케이스', 5),
    ('지갑/머니클립', '지갑/머니클립', 5),
    ('클러치 백', '클러치 백', 5),
    ('캐리어', '캐리어', 5);

-- 7. 신발 하위 카테고리 (parent_id = 6)
INSERT INTO categories (name, description, parent_id) VALUES
    ('스니커즈', '스니커즈', 6),
    ('패딩/퍼 신발', '패딩/퍼 신발', 6),
    ('부츠/워커', '부츠/워커', 6),
    ('스포츠화', '스포츠화', 6),
    ('구두', '구두', 6),
    ('샌들/슬리퍼', '샌들/슬리퍼', 6),
    ('신발용품', '신발용품', 6);